reservation.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header />
    <s:Body>
        <univ:AirCreateReservationReq xmlns:common_v41_0="http://www.travelport.com/schema/common_v41_0" xmlns:univ="http://www.travelport.com/schema/universal_v41_0" AuthorizedBy="user" RetainReservation="None" xmlns="http://www.travelport.com/schema/air_v41_0" TraceId="1982222261_1601282416" TargetBranch="P7106193">
            <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v41_0" OriginApplication="UAPI"></BillingPointOfSaleInfo>

            <BookingTraveler xmlns="http://www.travelport.com/schema/common_v41_0" Key="0" TravelerType="ADT" DOB="1990-03-14" Gender="M">
                <BookingTravelerName Prefix="Mrs" First="Anitha" Last="Gangapatanm" />
                <PhoneNumber Number="8050584929" Type="Mobile" />
                <Email EmailID="anitha.g.provab@gmail.com" Type="P" />
                <Address>
                    <AddressName>HIMANSHU</AddressName>
                    <Street>TEST</Street>
                    <City>TEST</City>
                    <State>TEST</State>
                    <PostalCode>560100</PostalCode>
                    <Country>IN</Country>
                </Address>
            </BookingTraveler>
            <FormOfPayment xmlns="http://www.travelport.com/schema/common_v41_0" Type="Cash"></FormOfPayment>
            <AirPricingSolution xmlns="http://www.travelport.com/schema/air_v41_0" Key="gDBGhT3R2BKAT5zXCAAAAA==" TotalPrice="INR15973" BasePrice="GBP22.00" ApproximateTotalPrice="INR15973" ApproximateBasePrice="INR2175" EquivalentBasePrice="INR2175" Taxes="INR13798" ApproximateTaxes="INR13798" QuoteDate="2020-10-06">
                <AirPricingInfo Key="gDBGhT3R2BKAT5zXCAAAAA==" TotalPrice="INR15973" BasePrice="GBP22.00" ApproximateTotalPrice="INR15973" ApproximateBasePrice="INR2175" EquivalentBasePrice="INR2175" ApproximateTaxes="INR13798" Taxes="INR13798">
                    <FareInfo Key="gDBGhT3R2BKAd5zXCAAAAA==" FareBasis="QOWBYD1W" PassengerTypeCode="ADT" Origin="STN" Destination="DXB" EffectiveDate="2020-10-06T16:09:00.000+05:30" DepartureDate="2020-12-02" Amount="INR2175" NotValidBefore="2020-12-02">
                        <FareRuleKey FareInfoRef="gDBGhT3R2BKAd5zXCAAAAA==" ProviderCode="1G">6UUVoSldxwhZjXRtKiPFrcbKj3F8T9EyxsqPcXxP0TLGyo9xfE/RMsuWFfXVd1OAly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA7dLLuPUIhqZxWa1uaqI55k3aSkvhp2ybYbkpiAj4xlHarlX6CKVpyRN3J3NyYpz6RDKFFZ4V12PQFDb+712lFDsE8x1K6Z2+WLgFn3B9sPdSU8gecfbWEnMU535bvD9TJMscFUjz8UphAevkIpVdc3OXN0QSTGD1UPFc7ZmQhP+mpBH9wehGMENcAPBqbPCNkGFEpk5QESP/AFKEXb03hK/he9va7VDH7+F729rtUMfv4Xvb2u1Qx+/he9va7VDHxDGJun84l6GmjYuszn207WOnxkQ2WPPHvaVUAnec78/1inYl1JZ1xx5BqgrcyYJEtwXtO9a1rEPNomuuq4tJiU=</FareRuleKey>
                    </FareInfo>
                    <BookingInfo CabinClass="Economy" FareInfoRef="gDBGhT3R2BKAd5zXCAAAAA==" SegmentRef="gDBGhT3R2BKAP5zXCAAAAA=="></BookingInfo>
                    <BookingInfo CabinClass="Economy" FareInfoRef="gDBGhT3R2BKAd5zXCAAAAA==" SegmentRef="gDBGhT3R2BKAR5zXCAAAAA=="></BookingInfo>
                    <PassengerType Code="ADT"></PassengerType>
                    <PassengerType Code="ADT"></PassengerType>
                    <ChangePenalty Amount="INR3738.0"></ChangePenalty>
                </AirPricingInfo>
                <AirSegment Key="gDBGhT3R2BKAP5zXCAAAAA==" Group="0" Carrier="PC" FlightNumber="1182" ProviderCode="1G" Origin="STN" Destination="SAW" DepartureTime="2020-12-02T12:50:00.000+00:00" ArrivalTime="2020-12-02T19:30:00.000+03:00" FlightTime="220" TravelTime="220" Distance="1547" ClassOfService="Q" Equipment="321" ChangeOfPlane="false" OptionalServicesIndicator="false" AvailabilitySource="" ParticipantLevel="Secure Sell" LinkAvailability="" PolledAvailabilityOption="" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked">
                    <CodeshareInfo OperatingCarrier="PC" OperatingFlightNumber=""></CodeshareInfo>
                    <AirAvailInfo ProviderCode="1G">
                        <BookingCodeInfo BookingCounts="9"></BookingCodeInfo>
                    </AirAvailInfo>
                    <FlightDetails Key="gDBGhT3R2BKAQ5zXCAAAAA==" Origin="STN" Destination="SAW" DepartureTime="2020-12-02T12:50:00.000+00:00" ArrivalTime="2020-12-02T19:30:00.000+03:00" FlightTime="220" TravelTime="220" Distance="1547"></FlightDetails>
                </AirSegment>
                <AirSegment Key="gDBGhT3R2BKAR5zXCAAAAA==" Group="0" Carrier="PC" FlightNumber="740" ProviderCode="1G" Origin="SAW" Destination="DXB" DepartureTime="2020-12-02T20:50:00.000+03:00" ArrivalTime="2020-12-03T02:15:00.000+04:00" FlightTime="265" TravelTime="265" Distance="1870" ClassOfService="Q" Equipment="321" ChangeOfPlane="false" OptionalServicesIndicator="false" AvailabilitySource="" ParticipantLevel="Secure Sell" LinkAvailability="" PolledAvailabilityOption="" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked">
                    <CodeshareInfo OperatingCarrier="PC" OperatingFlightNumber=""></CodeshareInfo>
                    <AirAvailInfo ProviderCode="1G">
                        <BookingCodeInfo BookingCounts="9"></BookingCodeInfo>
                    </AirAvailInfo>
                    <FlightDetails Key="gDBGhT3R2BKAS5zXCAAAAA==" Origin="SAW" Destination="DXB" DepartureTime="2020-12-02T20:50:00.000+03:00" ArrivalTime="2020-12-03T02:15:00.000+04:00" FlightTime="265" TravelTime="265" Distance="1870"></FlightDetails>
                </AirSegment>
                <FareNote Key="gDBGhT3R2BKAh5zXCAAAAA==">SUM IDENTIFIED AS UB IS A PASSENGER SERVICE CHARGE</FareNote>
                <FareNote Key="gDBGhT3R2BKAi5zXCAAAAA==">RATE USED IN EQU TOTAL IS BSR 1GBP - 98.679892INR</FareNote>
                <FareNote Key="gDBGhT3R2BKAj5zXCAAAAA==">LAST DATE TO PURCHASE TICKET: 06OCT20 DEL</FareNote>
                <FareNote Key="gDBGhT3R2BKAk5zXCAAAAA==">TICKETING AGENCY 5Y9U</FareNote>
                <FareNote Key="gDBGhT3R2BKAl5zXCAAAAA==">DEFAULT PLATING CARRIER PC</FareNote>
                <FareNote Key="gDBGhT3R2BKAm5zXCAAAAA==">E-TKT REQUIRED</FareNote>
                <FareNote Key="gDBGhT3R2BKAn5zXCAAAAA==">TICKETING FEES MAY APPLY</FareNote>
                <HostToken Key="gDBGhT3R2BKAU5zXCAAAAA==">GFB10101ADT00  01QOWBYD1W                              0200010002#GFB200010101NADTV3022PROM0020000399#GFMCSIP022NPROM PC ADTQOWBYD1W</HostToken>
            </AirPricingSolution>
            <ActionStatus ProviderCode="1G" TicketDate="T*" Type="ACTIVE" QueueCategory="01" xmlns="http://www.travelport.com/schema/common_v41_0"></ActionStatus>
            <!--<SpecificSeatAssignment xmlns="http://www.travelport.com/schema/air_v41_0" SeatId="5C" BookingTravelerRef="0" SegmentRef="O5nb3SPc1BKAdGOUzCAAAA==" />-->
        </univ:AirCreateReservationReq>
    </s:Body>
</s:Envelope>